---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LineLightShape.#ctor
source: html/266127e4-df48-7068-4bbf-d009d313a005.htm
---
# Autodesk.Revit.DB.Lighting.LineLightShape.#ctor Method

Creates a line light shape object with 2.0' emit length.

## Syntax (C#)
```csharp
public LineLightShape()
```